Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.main will be created
+ resource "aws_ecs_service" "main" {
      + cluster                            = "arn:aws:ecs:us-west-2:713516755744:cluster/tf-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "tf-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = "arn:aws:ecs:us-west-2:713516755744:task-definition/app:4"

      + load_balancer {
          + container_name   = "app"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:713516755744:targetgroup/tf-ecs-chat/caca1a67e5708ced"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-099d08c8c4625b940",
              + "subnet-0fafad9978e8d2d40",
            ]
        }

      + placement_strategy {
          + field = (known after apply)
          + type  = (known after apply)
        }
    }

  # aws_security_group.ecs_tasks is tainted, so must be replaced
-/+ resource "aws_security_group" "ecs_tasks" {
      ~ arn                    = "arn:aws:ec2:us-west-2:713516755744:security-group/sg-0123f718a50d5c64c" -> (known after apply)
        description            = "allow inbound access from the ALB only"
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      ~ id                     = "sg-0123f718a50d5c64c" -> (known after apply)
        ingress                = [
            {
                cidr_blocks      = []
                description      = ""
                from_port        = 3000
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = [
                    "sg-0cb0a501ebe3a5e4b",
                ]
                self             = false
                to_port          = 3000
            },
        ]
        name                   = "tf-ecs-tasks"
      ~ owner_id               = "713516755744" -> (known after apply)
        revoke_rules_on_delete = false
      - tags                   = {} -> null
        vpc_id                 = "vpc-0d8b0d42ebec72a87"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://287fc1e9f7ef:4141/lock?id=davejrt%252Fterraform-fargate-example%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
